# read design
read_verilog dff.v

# generic synthesis
synth -top DFlipFlop

clean

# write synthesized design
write_verilog synth.v
write_json dff.json
